RubyOnRails-RESTfulApp/app/controllers/employees_controller.rb

  def index
    @employees = Employees.paginate(:page => params[:page])
---
SELECT  `employees`.* FROM `employees`  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `employees`

  def create
    @employee = Employees.new(employee_params)

    if @employee.save
---
INSERT INTO `employees` (`birth_date`, `emp_no`, `first_name`, `gender`, `hire_date`, `last_name`) VALUES ('1985-03-24', 1, 'Nicole', 'F', '2005-03-07', 'MacDougall')

  def update
    @employee = Employees.find(params[:id])

    if @employee.update(employee_params)
---
UPDATE `employees` SET `first_name` = 'Crissy' WHERE `employees`.`emp_no` = 10004